{
    "0": {
        "name": "Alternaria Leaf Spot",
        "cure": "Apply fungicides with chlorothalonil or mancozeb.",
        "growth_tips": "Avoid prolonged leaf wetness and improve air circulation."
    },
    "1": {
        "name": "Anthracnose",
        "cure": "Use a fungicide with azoxystrobin. Remove infected plant debris.",
        "growth_tips": "Practice crop rotation and avoid overhead watering."
    },
    "2": {
        "name": "Bacterial Leaf Blight",
        "cure": "Apply copper-based sprays and remove infected plants.",
        "growth_tips": "Ensure proper plant spacing and avoid high humidity."
    },
    "3": {
        "name": "Bacterial Wilt",
        "cure": "Remove and destroy affected plants. Use resistant varieties.",
        "growth_tips": "Ensure proper soil drainage and avoid overwatering."
    },
    "4": {
        "name": "Black Rot",
        "cure": "Apply copper fungicides and remove affected leaves.",
        "growth_tips": "Use disease-free seeds and avoid overhead watering."
    },
    "5": {
        "name": "Blight",
        "cure": "Apply a copper fungicide and remove infected plant parts.",
        "growth_tips": "Rotate crops and avoid planting in the same soil yearly."
    },
    "6": {
        "name": "Brown Spot",
        "cure": "Use copper-based fungicides and remove infected leaves.",
        "growth_tips": "Ensure good drainage and avoid overhead irrigation."
    },
    "7": {
        "name": "Cercospora Leaf Spot",
        "cure": "Apply neem oil or copper fungicides.",
        "growth_tips": "Improve soil drainage and reduce plant stress."
    },
    "8": {
        "name": "Damping-Off",
        "cure": "Remove and destroy affected seedlings. Avoid overwatering and ensure good air circulation. Use fungicide-treated seeds or apply soil fungicides like captan or metalaxyl.",
        "growth_tips": "Use sterile, well-draining soil and avoid planting seeds too densely. Water in the morning to allow soil surface to dry and provide adequate light and ventilation."
    },
    "9": {
        "name": "Downy Mildew",
        "cure": "Apply fungicides like metalaxyl or copper-based sprays.",
        "growth_tips": "Ensure good air movement and reduce humidity around plants."
    },
    "10": {
        "name": "Early Blight",
        "cure": "Apply chlorothalonil or copper-based fungicides.",
        "growth_tips": "Mulch around plants to prevent soil splash."
    },
    "11": {
        "name": "Fusarium Wilt",
        "cure": "Use fungicides containing thiophanate-methyl. Rotate crops.",
        "growth_tips": "Improve soil health and avoid planting in contaminated areas."
    },
    "12": {
        "name": "Gray Mold",
        "cure": "Use fungicides like iprodione or thiophanate-methyl.",
        "growth_tips": "Increase airflow and remove dead plant material."
    },
    "13": {
        "name": "Healthy",
        "cure": "No treatment required. Maintain optimal watering and fertilization.",
        "growth_tips": "Ensure proper sunlight and regular pruning for better growth."
    },
    "14": {
        "name": "Leaf Curl",
        "cure": "Apply fungicides before bud break, such as Bordeaux mixture.",
        "growth_tips": "Use disease-resistant varieties and prune infected areas."
    },
    "15": {
        "name": "Leaf Spot",
        "cure": "Use fungicidal sprays and remove infected leaves promptly.",
        "growth_tips": "Water plants at the base and avoid wetting the leaves."
    },
    "16": {
        "name": "Mosaic Virus",
        "cure": "No chemical cure. Remove and destroy infected plants.",
        "growth_tips": "Control aphids and other pests that spread the virus."
    },
    "17": {
        "name": "Powdery Mildew",
        "cure": "Use fungicides containing sulfur or neem oil. Remove affected leaves.",
        "growth_tips": "Ensure proper air circulation and avoid overhead watering."
    },
    "18": {
        "name": "Rust",
        "cure": "Apply copper-based fungicides. Remove infected leaves to prevent spread.",
        "growth_tips": "Plant resistant varieties and maintain proper spacing."
    },
    "19": {
        "name": "Scab",
        "cure": "Apply fungicides containing sulfur or captan.",
        "growth_tips": "Use resistant plant varieties and prune regularly."
    },
    "20": {
        "name": "Septoria Leaf Spot",
        "cure": "Use fungicides with chlorothalonil or copper compounds.",
        "growth_tips": "Avoid excessive nitrogen fertilization and water at the base."
    },
    "21": {
        "name": "Sooty Mold",
        "cure": "Control the insects that cause mold buildup (e.g., aphids, whiteflies).",
        "growth_tips": "Use insecticidal soap and keep plants clean from honeydew."
    },
    "22": {
        "name": "Verticillium Wilt",
        "cure": "No effective treatment. Remove infected plants and improve soil.",
        "growth_tips": "Use disease-resistant varieties and improve soil aeration."
    },
    "23": {
        "name": "White Mold",
        "cure": "Apply fungicides like thiophanate-methyl and remove affected plants.",
        "growth_tips": "Improve soil drainage and avoid excessive moisture."
    },
    "24": {
        "name": "Yellow Leaf Curl Virus",
        "cure": "No cure available. Remove infected plants to prevent spread.",
        "growth_tips": "Control whiteflies as they spread the virus."
    }
}